---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.ReverseIterator
source: html/2e2f3ae2-81c2-52ec-26bc-c2a1384aacf3.htm
---
# Autodesk.Revit.DB.ModelCurveArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ModelCurveArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.